export default [
    {
        text: '工作知识碎片',
        items: [
            {
                text: '01.switch_if分支转换为map映射',
                link: '/工作知识碎片/01.switch_if分支转换为map映射'
            },
            {
                text: '02.vue中组件的使用',
                link: '/工作知识碎片/02.vue中组件的使用'
            },
            {
                text: '03.处理树形结构化',
                link: '/工作知识碎片/03.处理树形结构化'
            },
            {
                text: '04.动态组件切换',
                link: '/工作知识碎片/04.动态组件切换'
            },
            {
                text: '05.元素居中的方式',
                link: '/工作知识碎片/05.元素居中的方式'
            },
            {
                text: '06.元素宽度根据内容自适应',
                link: '/工作知识碎片/06.元素宽度根据内容自适应'
            },
            {
                text: '07.局部滚动的实现',
                link: '/工作知识碎片/07.局部滚动的实现'
            },
            {
                text: '08.通过os模块获取本地主机地址',
                link: '/工作知识碎片/08.通过os模块获取本地主机地址'
            },
            {
                text: '09.Vue3使用普通div标签实现单选以及多选效果',
                link: '/工作知识碎片/09.Vue3使用普通div标签实现单选以及多选效果'
            },
            {
                text: '10.请求缓存',
                link: '/工作知识碎片/10.请求缓存'
            }
        ],
        collapsed: true
    }
]
