export default [
    {
        text: 'Vue',
        items: [
            {
                text: '从0到1完成后台管理系统',
                items: [
                    {
                        text: '01.完成环境搭建',
                        link: '/前端体系/项目/Vue/从0到1完成后台管理系统/01.完成环境搭建'
                    },
                    {
                        text: '02.完成登录模块',
                        link: '/前端体系/项目/Vue/从0到1完成后台管理系统/02.完成登录模块'
                    },
                    {
                        text: '03.完成首页基本布局',
                        link: '/前端体系/项目/Vue/从0到1完成后台管理系统/03.完成首页基本布局'
                    },
                    {
                        text: '04.项目基本增、删、改、查的实现',
                        link: '/前端体系/项目/Vue/从0到1完成后台管理系统/04.项目基本增、删、改、查的实现'
                    },
                    {
                        text: '05.实现动态路由',
                        link: '/前端体系/项目/Vue/从0到1完成后台管理系统/05.实现动态路由'
                    }
                ],
                collapsed: true
            }
        ]
    }
]
